<a href="https://colab.research.google.com/github/frontier1020/colabstart/blob/master/ch07_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
data_tr = pd.read_csv("sample_data/california_housing_train.csv")
data_test = pd.read_csv("sample_data/california_housing_test.csv")

print("캘리포니아 데이터 행열(train) :", data_tr.shape)
print("캘리포니아 데이터 행열(test) :", data_test.shape)

캘리포니아 데이터 행열(train) : (17000, 9)
캘리포니아 데이터 행열(test) : (3000, 9)

In [4]:
print(data_tr.head())     # 5행만 보기
print(data_test.head(3)) # 3행만 보기
# tail를 이용하여 뒤에 5행을 볼 수 있음.
data_tr.tail()     # 뒤에서 5행만 보기

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]
   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81     33.78  ...         5.7934            270500.0

[3 rows x 9 columns]

       longitude  latitude  ...  median_income  median_house_value
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[5 rows x 9 columns]

In [0]:
### 구글 콜랩의 데이터 셋을 이용해서 csv, excel파일을 만들자.
data_tr.to_csv("data.csv", index=False)
data_tr.to_excel("data.xlsx", index=True)

### 파일을 불러와 보자.
excel_data = pd.read_excel("data.xlsx")
csv_data = pd.read_csv("data.csv")

In [8]:
### 파일 생성 확인(리눅스 명령 이용)
!ls

data.csv  data.xlsx  sample_data

In [9]:
excel_data.head()

   Unnamed: 0  longitude  ...  median_income  median_house_value
0           0    -114.31  ...         1.4936               66900
1           1    -114.47  ...         1.8200               80100
2           2    -114.56  ...         1.6509               85700
3           3    -114.57  ...         3.1917               73400
4           4    -114.57  ...         1.9250               65500

[5 rows x 10 columns]

In [10]:
csv_data.head()

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

In [11]:
print("데이터 열의 제목(train) : ", data_tr.columns) 
print("데이터 열의 제목(test) : ", data_test.columns)

데이터 열의 제목(train) :  Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')
데이터 열의 제목(test) :  Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

In [13]:
print(data_tr.info() )

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17000 entries, 0 to 16999
Data columns (total 9 columns):
longitude             17000 non-null float64
latitude              17000 non-null float64
housing_median_age    17000 non-null float64
total_rooms           17000 non-null float64
total_bedrooms        17000 non-null float64
population            17000 non-null float64
households            17000 non-null float64
median_income         17000 non-null float64
median_house_value    17000 non-null float64
dtypes: float64(9)
memory usage: 1.2 MB
None

In [14]:
print(data_test.info() )

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 9 columns):
longitude             3000 non-null float64
latitude              3000 non-null float64
housing_median_age    3000 non-null float64
total_rooms           3000 non-null float64
total_bedrooms        3000 non-null float64
population            3000 non-null float64
households            3000 non-null float64
median_income         3000 non-null float64
median_house_value    3000 non-null float64
dtypes: float64(9)
memory usage: 211.1 KB
None

In [18]:
import numpy as np
data_tr.iloc[0,1] = np.nan
data_test.iloc[2,1:8] = np.nan

print(data_tr.head() ) 
print(data_test.head() )

   longitude  latitude  ...  median_income  median_house_value
0    -114.31       NaN  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]
   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085            344700.0
1    -118.30     34.26  ...         3.5990            176500.0
2    -117.81       NaN  ...            NaN            270500.0
3    -118.36     33.82  ...         6.1359            330000.0
4    -119.67     36.33  ...         2.9375             81700.0

[5 rows x 9 columns]

In [19]:
print("train 데이터 셋 : ", data_tr.info() ) 
print("test 데이터 셋 : ", data_test.info() )

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17000 entries, 0 to 16999
Data columns (total 9 columns):
longitude             17000 non-null float64
latitude              16999 non-null float64
housing_median_age    16999 non-null float64
total_rooms           17000 non-null float64
total_bedrooms        17000 non-null float64
population            17000 non-null float64
households            17000 non-null float64
median_income         17000 non-null float64
median_house_value    17000 non-null float64
dtypes: float64(9)
memory usage: 1.2 MB
train 데이터 셋 :  None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 9 columns):
longitude             3000 non-null float64
latitude              2999 non-null float64
housing_median_age    2998 non-null float64
total_rooms           2998 non-null float64
total_bedrooms        2998 non-null float64
population            2999 non-null float64
households            2999 non-null float64
median_income         2999 non-null float64
median_house_value    3000 non-null float64
dtypes: float64(9)
memory usage: 211.1 KB
test 데이터 셋 :  None